package test.java;
/*   (c)   0kk1n4v4 - rnd 06/09/20
    Не совсем ясное тех. задание.
    Реализовать иерархию объектов Circle, Rectangle, Triangle, Square
    Пока что мутим несколько классов с параметрами и методами вычисления
 */


public class Main {


    public static void main(String[] args) {
	// write your code here


        System.out.println(rectangle.square(4,3));
    }
}
